BuiHoangNhan/ies_mcxc_project/MCXC444_Project2/source/1_Hardware/3_Led_IO/IO_driver.h
/*

*/
#ifndef IO_DRIVER_H
#define IO_DRIVER_H

#include <stdint.h>
#include "fsl_gpio.h"
#include "board.h"

#if LCD_CONTROLER

#define GPIO_AC_SENSING_MUX_SELA_PIN     2
#define GPIO_AC_SENSING_MUX_SELB_PIN     3

#define GPIO_AC_SENSING_MUX_SELA_B_GPIO    GPIOB

#define GPIO_GPIO_RELAY_1   19
#define GPIO_GPIO_RELAY_2   20
#define GPIO_GPIO_RELAY_3   21

#define GPIO_RELAY_GPIO    GPIOE

#define GPIO_LED_1   18
#define GPIO_LED_2   29
#define GPIO_LED_3   30

#define GPIO_LED_GPIO    GPIOE

#define GPIO_BUTTON_1 5
#define GPIO_BUTTON_2 6
#define GPIO_BUTTON_3 7
#define GPIO_BUTTON_4 0
#define GPIO_BUTTON_5 1

#define GPIO_BUTTON_GPIO1    GPIOC
#define GPIO_BUTTON_GPIO2    GPIOD

#define GPIO_BUTTON_PORT1    PORTC
#define GPIO_BUTTON_PORT2    PORTD

#define GPIO_BUTTON_1_IRQ    PORTC_PORTD_IRQn

#define GPIO_BUTTON_2_IRQ    PORTC_PORTD_IRQn


void Ac_sensing_sel_init(void);

void Ac_sensing_sel(uint8_t pin, uint8_t output);

void gpio_relay_init(void);

void Relay_set(uint8_t pin, uint8_t output);

void gpio_led_init(void);

void Led_set(uint8_t pin, uint8_t output);

void Button_init(void);

#elif NODE_NEMA

#include "fsl_dac.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dac"
#endif
#define GPIO_DIM_GPIO   GPIOB
#define GPIO_DIM_PIN    2

void DimOff_set(uint8_t output);


#endif

#endif /* IO_DRIVER_H */
